// Отправка измененных данных по очереди в консоли
// git status - Статус текущего локального репозитория
// git add . - Добавление измененных файлов на отправку
// git commit -m "какое-то сообщение" - привязка измененных файлов к сообщению 
// git push - отправка данных на удаленный репозиторий
// 
// Только для получения
// git pull - получение данных с удаленного репозитория

// git clone <Ссылка на репозиторий> - склонировать репозиторий
// ============================================================================
// Ошибка при обращение к переменной
// (опечатка, неправильное название, несуществование)
// Reference Error
// console.log(username);
// ============================================================================
// SyntaxError: Ощибка при написании синтаксиса, кода самого js
// (Скобки, циклы, условия, названия ключевых слов)
// if () {}
// ============================================================================
// TypeError: Когда  неправильно пользуемся 
// const n=4
// console.log(n=6)
// ============================================================================

// debugger // Точка остоновки для просмотра кода










